<!-- dflook/terraform-github-actions {"workspace":"verify-opentofu-2","backend_type":"remote","backend":"699e21cafb0c2ecd19fcd14a3715f83396e77e5f6d39d79929c0023bbf671ede","plan_job_ref":"Job Test Terraform cloud #224 at https://github.com/dflook/terraform-github-actions/actions/runs/7503550469","plan_hash":"6e7a7bd87866e573d0e14fe321135f138365a995de75414648e31cbddbce42f3","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __verify-opentofu-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #224](https://github.com/dflook/terraform-github-actions/actions/runs/7503550469)